{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "B-CAMP",
    "1": "B-DATE",
    "2": "B-GHETTO",
    "3": "B-LOC",
    "4": "B-ORG",
    "5": "B-PERS",
    "6": "I-CAMP",
    "7": "I-DATE",
    "8": "I-GHETTO",
    "9": "I-LOC",
    "10": "I-ORG",
    "11": "I-PERS",
    "12": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "is_decoder": false,
  "label2id": {
    "B-CAMP": 0,
    "B-DATE": 1,
    "B-GHETTO": 2,
    "B-LOC": 3,
    "B-ORG": 4,
    "B-PERS": 5,
    "I-CAMP": 6,
    "I-DATE": 7,
    "I-GHETTO": 8,
    "I-LOC": 9,
    "I-ORG": 10,
    "I-PERS": 11,
    "O": 12
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
